User_panal/Upload_Money/Upload_Money_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Upload_Money_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: Upload_Money_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Upload_Money_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Portfolio/UploadMoney)
      - clickByID(Name)
      - typeByID(Name): "arslan"
      - typeByID(Name): "arslan"
      - keysByID(Name): KEY_DOWN
      - keysByID(Name): KEY_TAB
      - typeByID(BankName): "Habeeb Bank"
      - typeByID(AccountNumber): "123456789"
      - typeByID(AmmountMoney): "50000"
      - clickByID(Email)
      - typeByID(Email): "bank@gmail.com"
      - clickByID(PhoneNumber)
      - typeByID(PhoneNumber): "03313340700"
      - clickByCSS(input.btn.btn-primary)

  Upload_Money_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Portfolio/MoneySave'
            method: POST
            label: 'http://localhost:33143/Portfolio/MoneySave'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:33143'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Portfolio/UploadMoney'
            body:
              AccountNumber: '123456789'
              AmmountMoney: '50000'
              BankName: Habeeb Bank
              Email: bank@gmail.com
              Name: arslan
              PhoneNumber: '03313340700'
              __RequestVerificationToken: fehbUwzIp9vAwSje9r0Ln2-FoswQj7wltVk6BFMDXEvF_J0tXLyuff5Bx8gFCHMl7hi9o_N4u-Dbhfjf1AA0yM_vPRa8cQ229mfhH26-3Sc1
          - url: 'http://localhost:33143/Portfolio/shareperchase'
            method: GET
            label: 'http://localhost:33143/Portfolio/shareperchase'
            think-time: 74ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Portfolio/UploadMoney'
          - url: 'http://localhost:35852/fb20eca1c46d47b7ab0ec7ce96520416/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAADA9bX9Qvf6Quv8sgxl%2FLXIrEmO7g62WXD4%2BPTBhZD%2BBQAAAAAOgAAAAAIAACAAAAC9U%2FK387AYegYQVQ5wof5WNTmAq39JRMcyFmMJ0NiP2jAAAABUp%2BjWUwa3fowHd3euCp3RPURJQP2OCWcMjaDNwbGgC71mflKTAu%2Bt73Ibgh0ZyklAAAAAoQuixmpA%2BgB03bRf5xyQj%2BGBiJxUh3HLO%2BSGOLu4foTwiniUTdZh9aXAVI5sveIhyiBn5%2Bcc%2Fy27JQ5PWg90JQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FPortfolio%2FUploadMoney&browserName=Chrome'
            method: POST
            label: 'http://localhost:35852/fb20eca1c46d47b7ab0ec7ce96520416/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAADA9bX9Qvf6Quv8sgxl%2FLXIrEmO7g62WXD4%2BPTBhZD%2BBQAAAAAOgAAAAAIAACAAAAC9U%2FK387AYegYQVQ5wof5WNTmAq39JRMcyFmMJ0NiP2jAAAABUp%2BjWUwa3fowHd3euCp3RPURJQP2OCWcMjaDNwbGgC71mflKTAu%2Bt73Ibgh0ZyklAAAAAoQuixmpA%2BgB03bRf5xyQj%2BGBiJxUh3HLO%2BSGOLu4foTwiniUTdZh9aXAVI5sveIhyiBn5%2Bcc%2Fy27JQ5PWg90JQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FPortfolio%2FUploadMoney&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Portfolio/UploadMoney'
          - url: 'http://localhost:35852/fb20eca1c46d47b7ab0ec7ce96520416/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:35852/fb20eca1c46d47b7ab0ec7ce96520416/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Portfolio/shareperchase'
            body:
              requestUrl: 'http://localhost:33143/Portfolio/shareperchase'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546002741671'
          - url: 'http://localhost:33143/__browserLink/requestData/9ad2ca3e42a84b6ebf5d25051c4e9230'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/9ad2ca3e42a84b6ebf5d25051c4e9230'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Portfolio/shareperchase'